app/controllers/tasks_controller.rb

  def create
    @task = Task.create(params[:task])
---
INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES('Some New Task', '2009-06-14 11:29:54', '2009-06-14 11:29:54')